# GetOpenConnectorIndicatorTowardsColor Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIFabricationUtils..::..GetOpenConnectorIndicatorTowardsColor Method
UIFabricationUtils Class See Also
---
Gets the color of the open connector indicator in towards direction.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public static Color GetOpenConnectorIndicatorTowardsColor()
```

Visual Basic
---
```text
Public Shared Function GetOpenConnectorIndicatorTowardsColor As Color
```

Visual C++
---
```text
public:
static Color^ GetOpenConnectorIndicatorTowardsColor()
```

# See Also
UIFabricationUtils Class
Autodesk.Revit.UI Namespace